Pandas Module In Python

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "Name":["Harry","Rohan","Skiilf","Shubh"],
    "Marks":[93,35,31,29],
    "City":["rampur","kolkata","ahmedabad","surat"]
}

In [3]:
# Creating dataframe using given dictionary
df = pd.DataFrame(dict1)
df

     Name  Marks       City
0   Harry     93     rampur
1   Rohan     35    kolkata
2  Skiilf     31  ahmedabad
3   Shubh     29      surat

In [6]:
# Gives first 2 columns
# df.head(2)

# Gives last 2 columns
df.tail(2)

     Name  Marks       City
2  Skiilf     31  ahmedabad
3   Shubh     29      surat

In [7]:
# Generate descriptive statistics of int colums
df.describe()

           Marks
count   4.000000
mean   47.000000
std    30.767949
min    29.000000
25%    30.500000
50%    33.000000
75%    49.500000
max    93.000000

In [10]:
df.loc[(df['Marks']>=35)]

    Name  Marks     City
0  Harry     93   rampur
1  Rohan     35  kolkata

In [12]:
df.iloc[0,1] # Return from 0th row and 1st column

93

Pandas has two types of data structure. 
1 - Series 
2 - Dataframe

In [18]:
ser  = pd.Series(np.random.rand(50))

In [19]:
ser

0     0.030798
1     0.842019
2     0.558218
3     0.471741
4     0.908458
5     0.066505
6     0.020066
7     0.396051
8     0.238599
9     0.820642
10    0.644987
11    0.248117
12    0.445762
13    0.205153
14    0.783119
15    0.450708
16    0.836399
17    0.195292
18    0.233439
19    0.312529
20    0.747790
21    0.303519
22    0.338253
23    0.040502
24    0.614034
25    0.666633
26    0.991694
27    0.814763
28    0.130387
29    0.241141
30    0.202070
31    0.965719
32    0.977742
33    0.178031
34    0.994122
35    0.359278
36    0.233934
37    0.097055
38    0.238817
39    0.432552
40    0.784594
41    0.614754
42    0.655924
43    0.031439
44    0.796191
45    0.713200
46    0.898474
47    0.940429
48    0.560902
49    0.039994
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [21]:
newdf = pd.DataFrame(np.random.rand(50,5))
newdf.head()

          0         1         2         3         4
0  0.085403  0.771890  0.601191  0.958602  0.795741
1  0.392366  0.260012  0.131856  0.443027  0.225093
2  0.470018  0.071110  0.197145  0.670449  0.405672
3  0.325482  0.769935  0.952444  0.368046  0.335161
4  0.460783  0.245514  0.083644  0.824569  0.075749

In [23]:
#type(newdf) # pandas.core.frame.DataFrame
#type(newdf[0]) # pandas.core.series.Series

pandas.core.series.Series